//Урок 2 модуль 3 Домашняя
//14.12.2017



#include <stdio.h>
#include <locale.h>
#include <iostream>
#include <math.h>
#include <ctime>
using namespace std;

int main()
{
	MyStart:
	enum points
	{
		D = 2, C, B, A
	};

	setlocale(LC_ALL, "Rus");

	int task;
	char yn = 0;
	cout << "Введите номер задания от 1 до 7 - ";
	cin >> task;

	switch (task)
	{

#pragma region TASK1
	case 1:
	{
		cout << "Напишите функцию f(int& h, int& m, int& s, int sec),\n";
		cout << "которая принимает количество секунд, прошедших с начала дня, \n";
		cout << "и возвращает три целых переменных (часы, минуты и секунды)\n";
	task1:
		int m = 0, s, h = 0;
		cout << "Введите количество секунд - ";
		cin >> s;
		if (s < 1500)
		{
			cout << "Как то неинтересно... введи число побольше))" << endl;
			goto task1;
		}
		else
		{
			do
			{
				s -= 60;
				m += 1;
				cout << h << "~~~~~" << m << "~~~~~~ " << s << endl;

			} while (s >= 60);

			system("pause");
			if (m >= 60)
			{
				do
				{
					m -= 60;
					h += 1;

				} while (m >= 60);
			}
			cout << h << " : " << m << " : " << s << " : " << endl;
		}

	} break;
#pragma endregion

#pragma region TASK2
		case 2:
		{
			cout << "Напишите функцию int f(int x), которая принимает целое значение\n";
			cout << "(не больше пяти знаков) и возвращает число с обратным порядком цифр.\n";
			cout << "Например, принимается число 7631, возвращается число 1367\n";

			task2:
			int a;
			cout << "Введите двухзначное, трехзначное, четырехзначное или пятизначное число - ";
			cin >> a;
			if (a >= 10 && a <= 99)
			{
				int b;
				b = a % 10;
				a /= 10;
				cout << b << a << endl;
			}
			else if (a >= 100 && a <=999)
			{
				int b, c;
				b = a % 10;
				c = (a % 100) / 10;
				a /= 100;
				cout << c << b << a << endl;
			}
			else if (a >= 1000 && a <=9999)
			{
				int b, c, d;
				b = a % 10;
				c = (a % 100) / 10;
				d = (a % 1000) / 100;
				a /= 1000;
				cout << b << c << d << a << endl;
			}
			else if (a >= 10000 && a <=99999)
			{
				int b, c, d, e;
				b = a % 10;
				c = (a % 100) / 10;
				d = (a % 1000) / 100;
				e = (a % 10000) / 1000;
				a /= 10000;
				cout << b << c << d << e << a << endl;
			}
			else
			{
				cout << "Введены недопустимые символы. Введите цифры ещё раз" << endl;
				goto task2;
			}
		} break;
#pragma endregion

#pragma region TASK3
		case 3:
		{	
			task3:
			cout << "Является ли пятизначное целое число N палиндромом??\n";
			int a;
			cout << "Введите пятизначное число - ";
			cin >> a;
			if (a >= 10000 && a <= 99999)
			{
				int b, c, d, e;
				b = a % 10;
				c = (a % 100) / 10;
				d = (a % 1000) / 100;
				e = (a % 10000) / 1000;
				a /= 10000;
				if (a == e && a == d && a == c && a == b)
				{
					cout << "Данное число палиндром!!!" << endl;
					cout << a << e << d << c << b << endl;
				}
				else if (a == e && a == c && a == b)
				{
					cout << "Данное число палиндром!!!" << endl;
					cout << a << e << d << c << b << endl;
				}
				else if (a == b && e == c)
				{
					cout << "Данное число палиндром!!!" << endl;
					cout << a << e << d << c << b << endl;
				}
				else
				{
					cout << "Данное число НЕ палиндром!!!" << endl;
					cout << a << e << d << c << b << endl;

				}
			}
			else
			{
				cout << "ERRRROR!!!!!!!!\n";
				goto task3;
			}

		} break;
#pragma endregion

#pragma region TASK4
		case 4:
		{	

			cout << "Является ли число совершенным ?\n";
			int num, sum = 0;
			cout << "Введите число - ";
			cin >> num;
			for (int d = num / 2; d >= 1; --d)
			{	
				cout << d << endl;
				if (num % d == 0)
				{
					sum += d;
				}
			}
			if (num == sum)
			{
				cout << "Число совершенно!!!" << num << " = " << sum << endl;
			}
			else
			{
				cout << "Число не совершенно!!!" << num << " != " << sum << endl;
			}


		}break;
#pragma endregion

#pragma region TASK5
		case 5:
		{
			cout << "Напишите программу, которая с помощью функции rand()\n";
			cout << "ставит оценки в пределах от 2 до 5. В файл протокола направляйте слово “Неуд” при появлении 2,\n";
			cout << "«Удовл» при появлении 3, и т.д. Используйте оператор switch.\n";
			srand(time(NULL));
			int random = rand() % 5 + 2;
			switch (random)
			{
			case D: cout << random << "Учись давай!!!\n";
				break;
			case C: cout << random << "ПЛОХО!!!!!!!Учись давай!!!\n";
				break;
			case B: cout << random << "Уже лучше!!! Учись давай!!!\n";
				break;
			case A: cout << random << "ОТЛИЧНО!!!! Не сдавайся\n";
				break;
			}

		} break;
#pragma endregion

#pragma region TASK6
		case 6:
		{	
			task6:
			cout << "Билет на одну поездку в метро стоит 15 тенге, \n";
			cout << "билет на 10 поездок стоит 125 тенге, билет на 60 поездок стоит 440 тенге. \n";
			cout << "Пассажир планирует совершить n поездок. Определите, сколько билетов \n";
			cout << "каждого вида он должен приобрести, чтобы суммарное количество оплаченных поездок\n";
			cout << "было не меньше n, а общая стоимость приобретенных билетов – минимальна.\n";
			cout << "Входные данные: количество поездок n. Выходные данные – три целых числа, \n";
			cout << "равные необходимому количеству билетов на 1, на 10, на 60 поездок.\n";
			cout << "Например, при вводе 129 программа должна вывести 9 0 2 (2 билета на\n";
			cout << "60 поездок и 0 билет на 10 поездок, 9 билетов на 1 поездку).\n";
			int n, poez60 = 0, poez10 = 0, poez1 = 0;
			cout << "Введите количество поездок - ";
			cin >> n;
			if (n >= 60)
			{
				while (n >= 60)
				{
					n -= 60;
					poez60 += 60;
				}
				if (n < 60 && n >= 10)
				{
					while (n >= 10)
					{
						n -= 10;
						poez10 += 10;

					}
					if (n < 10 && n >= 1)
					{
						while (n >= 1)
						{
							n -= 1;
							poez1 += 1;
						} 
						cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
						cout << "На 10 поездок небоходимо взять - " << poez10 / 10 << " билетов.\n";
						cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
					}
					else
					{
						cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
						cout << "На 10 поездок небоходимо взять - " << poez10 / 10 << " билетов.\n";
						cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
					}
					
				}
				else if (n >= 1 && n < 10)
				{
					while (n >= 1)
					{
						n -= 1;
						poez1 += 1;
					}
					cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
					cout << "На 10 поездок небоходимо взять - " << poez10 << " билетов.\n";
					cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
				}
				else
				{
					cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
					cout << "На 10 поездок небоходимо взять - " << poez10 << " билетов.\n";
					cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
				}
			}
			else if (n >= 10 && n < 60)
			{
				while (n >= 10)
				{
					n -= 10;
					poez10 += 10;
				} 
				if (n < 10 && n >= 1)
				{
					while (n >= 1)
					{
						n -= 1;
						poez1 += 1;
					}
					cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					cout << "На 10 поездок небоходимо взять - " << poez10 / 10 << " билетов.\n";
					cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
				}
				else
				{
					cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					cout << "На 10 поездок небоходимо взять - " << poez10 / 10 << " билетов.\n";
					cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
				}
			}
			else if (n < 10 && n >= 1)
			{
				while (n > 1)
				{
					n -= 1;
					poez1 += 1;
				} 
				cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
				cout << "На 10 поездок небоходимо взять - " << poez10 << " билетов.\n";
				cout << "На 1 поездку небоходимо взять - " << poez1 << " билетов\n";
			}
			else
			{
				cout << "ERRORRR\n";
				goto task6;
			}


		}
#pragma endregion

#pragma region TASK7

		case 7:
		{
			cout << "Введите количество билетов - ";
			int n, poez1 = 0, poez5 = 0, poez10 = 0, poez20 = 0, poez60 = 0;
			cin >> n;
			if (n >=60)
			{
				while (n >= 60)
				{
					n -= 60;
					poez60 += 60;
				}
				if (n < 60 && n >= 20)
				{
					while (n >= 20)
					{
						n -= 20;
						poez20 += 20;
					} 
					if (n < 20 && n >= 10)
					{
						while (n >= 10)
						{
							n -= 10;
							poez10 += 10;
						} 
						if (n < 10 && n >= 5)
						{
							while (n >= 5)
							{
								n -= 5;
								poez5 += 5;
							}
							if (n < 5 && n >= 1)
							{
								while (n >= 1)
								{
									n -= 1;
									poez1 += 1;
								}
								cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
								cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
								cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
								cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
								cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
							}
							else
							{
								cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
								cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
								cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
								cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
								cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
							}
						}
						else if (n < 5 && n >= 1)
						{
							while (n >= 1)
							{
								n -= 1;
								poez1 += 1;
							}
							cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
						else
						{
							cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
					}
					else if (n < 10 && n >= 5)
					{
						while (n >= 5)
						{
							n -= 5;
							poez5 += 5;
						}
						if (n < 5 && n >= 1)
						{
							while (n >= 1)
							{
								n -= 1;
								poez1 += 1;
							}
							cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
					}
					else if (n < 5 && n >= 1)
					{
						while (n >= 1)
						{
							n -= 1;
							poez1 += 1;
						}
						cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
						cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
						cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
						cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
						cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					}
					else
					{
						cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
						cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
						cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
						cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
						cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					}
				}
				else if (n < 20 && n >= 10)
				{
					while (n >= 10)
					{
						n -= 10;
						poez10 += 10;
					}
					if (n < 10 && n >= 5)
					{
						while (n >= 5)
						{
							n -= 5;
							poez5 += 5;
						}
						if (n < 5 && n >= 1)
						{
							while (n >= 1)
							{
								n -= 1;
								poez1 += 1;
							}
							cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
					}
				}
				else if (n < 10 && n >= 5)
				{
					while (n >= 10)
					{
						n -= 10;
						poez10 += 10;
					}
					if (n < 10 && n >= 5)
					{
						while (n >= 5)
						{
							n -= 5;
							poez5 += 5;
						}
						if (n < 5 && n >= 1)
						{
							while (n >= 1)
							{
								n -= 1;
								poez1 += 1;
							}
							cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
					}
				}
				else if (n < 5 && n >= 1)
				{
					while (n >= 1)
					{
						n -= 1;
						poez1 += 1;
					}
					cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
					cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
					cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
					cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
					cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				}
				else
				{
					cout << "На 60 поездок необходимо взять - " << poez60 / 60 << " билетов.\n";
					cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
					cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
					cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
					cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				}
			}
			else if (n < 60 && n >= 20)
			{
				while (n >= 20)
				{
					n -= 20;
					poez20 += 20;
				}
				if (n < 20 && n >= 10)
				{
					while (n >= 10)
					{
						n -= 10;
						poez10 += 10;
					}
					if (n < 10 && n >= 5)
					{
						while (n >= 5)
						{
							n -= 5;
							poez5 += 5;
						}
						if (n < 5 && n >= 1)
						{
							while (n >= 1)
							{
								n -= 1;
								poez1 += 1;
							}
							cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
						else
						{
							cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
							cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
							cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
							cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
							cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
						}
					}
					else if (n < 5 && n >= 1)
					{
						while (n >= 1)
						{
							n -= 1;
							poez1 += 1;
						}
						cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
						cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
						cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
						cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
						cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					}
					else
					{
						cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
						cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
						cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
						cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
						cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					}
				}
				else if (n < 10 && n >= 5)
				{
					while (n >= 5)
					{
						n -= 5;
						poez5 += 5;
					}
					if (n < 5 && n >= 1)
					{
						while (n >= 1)
						{
							n -= 1;
							poez1 += 1;
						}
						cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
						cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
						cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
						cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
						cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					}
				}
				else if (n < 5 && n >= 1)
				{
					while (n >= 1)
					{
						n -= 1;
						poez1 += 1;
					}
					cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
					cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
					cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
					cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				}
				else
				{
					cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					cout << "На 20 поездок необходимо взять - " << poez20 / 20 << " билетов.\n";
					cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
					cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
					cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				}
			}

			 else if (n < 20 && n >=10)
			 {
				 while (n >= 10)
				 {
					 n -= 10;
					 poez10 += 10;
				 }
				 if (n < 10 && n >= 5)
				 {
					 while (n >= 5)
					 {
						 n -= 5;
						 poez5 += 5;
					 }
					 if (n < 5 && n >= 1)
					 {
						 while (n >= 1)
						 {
							 n -= 1;
							 poez1 += 1;
						 }
						 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
						 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
						 cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
						 cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
						 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					 }
					 else
					 {
						 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
						 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
						 cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
						 cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
						 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
					 }
				 }
				 else if (n < 5 && n >= 1)
				 {
					 while (n >= 1)
					 {
						 n -= 1;
						 poez1 += 1;
					 }
					 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
					 cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
					 cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
					 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				 }
				 else
				 {
					 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
					 cout << "На 10 поездок необходимо взять - " << poez10 / 10 << " билетов.\n";
					 cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
					 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				 }
			 } 
			 else if (n < 10 && n >= 5)
			 {
				 while (n >= 5)
				 {
					 n -= 5;
					 poez5 += 5;
				 }
				 if (n < 5 && n >= 1)
				 {
					 while (n >= 1)
					 {
						 n -= 1;
						 poez1 += 1;
					 }
					 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
					 cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
					 cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
					 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				 }
				 else
				 {
					 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
					 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
					 cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
					 cout << "На 5 поездок необходимо взять - " << poez5 / 5 << " билетов.\n";
					 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
				 }
			 }
			 else if (n < 5 && n >= 1)
			 {
				 while (n >= 1)
				 {
					 n -= 1;
					 poez1 += 1;
				 }
				 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
				 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
				 cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
				 cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
				 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
			 }
			 else
			 {
				 cout << "На 60 поездок необходимо взять - " << poez60 << " билетов.\n";
				 cout << "На 20 поездок необходимо взять - " << poez20 << " билетов.\n";
				 cout << "На 10 поездок необходимо взять - " << poez10 << " билетов.\n";
				 cout << "На 5 поездок необходимо взять - " << poez5 << " билетов.\n";
				 cout << "На 1 поездку необходимо взять - " << poez1 << " билетов.\n";
			 }
		} break;
#pragma endregion





		default:
		{
			cout << "ERROR\n Введите задание ещё раз!!!" << endl;
			goto MyStart;
		}
			break;
	}



	system("pause");
}